# Big Data Processes - Exercise Week 1

## <font color = green>Introduction</font>

Command mode and edit mode

Good shortcuts to keep in mind:

<ul>
    <li><i> Shift+Enter </i>: Execute a cell and advance to the next one</li>
    <li><i> Ctrl+Enter or Command+Enter </i>: Execute a cell and remain on it</li>
    <li>(In command mode)<i> dd </i>: Delete cell</li>
    <li>(In command mode)<i> z </i>: Undo deletion</li>
</ul>

Writing notes in your code is super helpful! Choose Markdown in the drop down down menu above, if you want to write something in text format. You can start a sentence with # if you want to write text in the same field as your code.

#### 1. Importing an external library - Pandas

In [1]:
import pandas as pd

pandas is a library containing functions that we are going to use. We use these functions to expedite the data analysis process. 

There are many different libraries, and they are very helpful as they contain prewritten code that generally help optimize processes.

pd is a deliberate alias that refers to pandas in this case. It allows shorter references later on.

To understand what are the capabilities of this library read more here: https://pandas.pydata.org/

If you are curious about other libraries in Python you can check this link out: https://www.edureka.co/blog/python-libraries/. It might not make sense now, but it can be useful later on.

#### 2. Importing the dataset

As we in this course focus on analyzing data, it is quite useful to be able to open a dataset. These datasets comes in different types of files. In this section we will practice opening different datasets.

In [2]:
dataset_tsv = pd.read_csv('Data.txt', delimiter = '\t')

"dataset_tsv" is the name of the dataframe, you decide what the name should be. 

Some find it helpful to name their datasets depending on what the content of the file is e.g, "health", other just name their dataframes df, and that is perfectly okay too. You just need to remember that you will be writing the name of the dataframe often and names like: the_health_data_of_several_different_countries might not be the most effective name. As you progress you might work with several different dataframes in your Jupyter Notebook, so keeping a list of what the different dataframes contain might be helpful. 

"pd" we know from earlier as the alias for the library pandas

"read_csv" reads commaseparated values into the dataframe

"Data.txt" is the name of the file we want to open. To be able to open it like this the jupyter notebook and the file needs to be saved in that same folder

For the delimiter you choose how the values are separated in your file.

###### There are other ways to open files;

dataset_csv = pd.read_csv('Data.csv', delimiter = ',',encoding = 'utf-8', header = 0)

dataset_json = pd.read_json('Data.json')

dataset_excel = pd.read_excel('Data.xlsx', index_cols = 0, header = 0)

You can find more information about them here

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_json.html

https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html

#### 3. Opening the dataset and examining it

Often you want to have a look at what your dataframe look like and what:

In [3]:
dataset_tsv

#Checking what have we stored in the variable

     Country   Age   Salary Purchased
0     France  44.0  72000.0        No
1      Spain  27.0  48000.0       Yes
2    Germany  30.0  54000.0        No
3      Spain  38.0  61000.0        No
4    Germany  40.0      NaN       Yes
..       ...   ...      ...       ...
65  Pakistan  37.0  25000.0       Yes
66    Israel  70.0  80000.0        No
67   Tunisia  42.0  36000.0        No
68   Algeria  20.0  18000.0        No
69   Morocco  60.0  56000.0       Yes

[70 rows x 4 columns]

#### 4. Redefining and using a method
We want to shorten the name of the dataframe dataset_tsv, to do so we just assign it to a new variable:

In [4]:
ds = dataset_tsv

Using the .head() method on our new variable will give us the first five rows of our dataframe

In [5]:
ds.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

If you want to display a specific number of rows from the top, you use the .head() method with a number in the brackets.

In [7]:
ds.head(10)

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

Using a .tail() method will give you the five last rows

In [8]:
ds.tail()

     Country   Age   Salary Purchased
65  Pakistan  37.0  25000.0       Yes
66    Israel  70.0  80000.0        No
67   Tunisia  42.0  36000.0        No
68   Algeria  20.0  18000.0        No
69   Morocco  60.0  56000.0       Yes

Just like before, you can insert a number into the brackets and it will give you that number of rows

In [9]:
ds.tail(3)

    Country   Age   Salary Purchased
67  Tunisia  42.0  36000.0        No
68  Algeria  20.0  18000.0        No
69  Morocco  60.0  56000.0       Yes

### You're now ready to try it yourself!

#### 1. Using markdowns

Can you turn this question into a green header?

#### 2. Using methods

Use what you learned so far to find what country is in row 48

    Country   Age   Salary Purchased
48  Ukraine  24.0  18000.0       Yes

#### 3. Creating a new variable

Can you create a variable named <i> "last_5_rows" </i> and assign the last 5 rows of the dataset to it?

#### 4. Create and open your own file 
Create a .txt file and give it a name. Within that file paste in the following three lines:

One;Two;Three;Four\
1;2;3;4\
I;II;III;IV

See if you can identify the <b>delimiter</b> and open the file yourself.\
<i>(Make sure to save your .txt file in the same forlder where this Jupyter notebook file is)</i>

#### 5. Opening an excel file (Extra Exercise)

Try creating an excel file with data in it (or use one you already have) and open it from a different folder than the one your JN is saved in.

# Did you learn something Today?

##### Do you know what a library is?

##### Can you open different types of files?

##### Can you apply methods to your dataframe to visualize different rows?